/*
题目描述
学完黄老师的课，学会了循环，那么今天来打印一个九九乘法表吧？

输入格式
没有输入哦，直接打印！
输出格式
输出九九乘法表，乘法的乘积占两位，并靠左对齐，每个乘法表达式之间有一个空格！

注意：要使用双重循环！

样例输入
无
样例输出
1*1=1
1*2=2  2*2=4
1*3=3  2*3=6  3*3=9
1*4=4  2*4=8  3*4=12 4*4=16
1*5=5  2*5=10 3*5=15 4*5=20 5*5=25
1*6=6  2*6=12 3*6=18 4*6=24 5*6=30 6*6=36
1*7=7  2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
1*8=8  2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64
1*9=9  2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81
*/

#include <stdio.h>

int main() 
{
    int i;
    for ( i = 1; i < 10; i++)
    {   
        int j;
        for ( j = 1; j < i+1; j++)
        {
            printf("%d*%d=%d ",j,i,j*i);
            if (j*i < 10)
            {
                printf(" ");
            }
            
        }
        printf("\n");
    }
    return 0;
} 